update the documentation
